{
  "main": {
    "name": "Manish Sondhi",
    "occupation": "Product & UI/UX Designer",
    "description": "I am a Product & UI/UX Designer at CYNC Software",
    "image": "profilepic.jpg",
    "bio": "Hi there! I am Manish! Creative and detail-oriented UI/UX Designer with over 6+ years of experience crafting user-centric designs and improving customer interactions across a variety of complex systems and platforms. Adept at blending aesthetics with functionality to deliver engaging, intuitive, and seamless user experiences. Proven expertise in leading design processes from concept to implementation, employing a range of UX methodologies such as user research, journey mapping, wireframing, and prototyping. Experienced in collaborating with cross-functional teams including developers, product owners, and business analysts to translate business requirements into efficient and scalable design solutions. Strong front-end knowledge with a solid understanding of HTML5, CSS3, Angular, and TypeScript, enabling effective communication and collaboration with development teams to ensure designs are both technically feasible and aligned with product goals. Highly proficient in industry-standard design tools such as Figma, Adobe XD, and Sketch, and skilled in leveraging responsive design principles to ensure a consistent experience across various devices and screen sizes. Hands-on experience working in Agile environments, contributing to sprint planning, backlog prioritization, and UX strategy, while advocating for continuous user testing and iterative design improvements. Known for implementing human-centered design practices, increasing user satisfaction, and improving key metrics for enterprise-level clients like Bank of America, TD Bank, and CYNC Software. Capable of handling the full spectrum of UX/UI responsibilities from user research and wireframing to high-fidelity prototyping and usability testing with a keen focus on enhancing user engagement, accessibility, and overall product usability.",
    "contactmessage": "",
    "email": "ManishSondhi94@gmail.com",
    "phone": "609-816-5121",
    "address": {
      "street": "82 Theresa Court",
      "city": "Galloway",
      "state": "New Jersey",
      "zip": "08205"
    },
    "website": "https://www.manishsondhi.com/",
    "resumeDownload": "Manish Sondhi Resume",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/manish-sondhi-2b3bb2217/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Manishs94/",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Southern New Hampshire University",
        "degree": "Bachelor's Degree, Information Technology",
        "description": "Graduated with a great learning experience in Information Technology"
      },
      {
        "school": "Foundations of User Experience (UX) Design",
        "degree": "Google",
        "description": "Certified in Foundations of User Experience (UX) Design from Google"
      },
      {
        "school": "Start the UX Design Process: Empathize, Define, and Ideate",
        "degree": "Google",
        "description": "Certified in Start the UX Design Process: Empathize, Define, and Ideate from Google "
      },
      {
        "school": "Build Wireframes and Low-Fidelity Prototypes",
        "degree": "Google",
        "description": "Certified in Build Wireframes and Low-Fidelity Prototypes from Google"
      }
    ],
    "work": [
      {
        "company": "Cync Software",
        "title": "Senior UI/UX Designer",
        "years": "Febuary 2022 - Present",
        "description": "As a Senior UI/UX Designer, I have been instrumental in defining, designing, and optimizing user experiences for complex digital products. I work closely with C-level executives, product managers, and cross-functional teams to translate business requirements into intuitive and impactful user interfaces, leading to measurable improvements in user engagement and satisfaction. Strategic Design Leadership: Led the UX strategy for critical application features, simplifying complex processes like Collateral Relationship Stock and Exposure platforms, driving a 20% increase in user engagement. Human-Centered Design: Applied design thinking techniques, including journey mapping, personas, and user interviews, to identify user pain points and deliver streamlined, accessible, and responsive designs, improving usability by 30%. Data-Driven Decisions: Leveraged analytics and usability testing (A/B testing, focus groups) to inform design decisions and improve product features, resulting in a 15% increase in user satisfaction. Cross-Functional Collaboration: Regularly interfaced with developers to ensure technical feasibility, and collaborated with stakeholders to align designs with business objectives, reducing feature development cycles by 10%. Design Tools & Methodologies: Expert in Figma, Adobe XD, Jira, Confluence, and Miro. Proficient in UX methodologies such as wireframing, prototyping, journey mapping, and usability testing. By consistently focusing on both user needs and business goals, I’ve successfully improved the overall user experience and contributed to significant product enhancements."
      },
      {
        "company": "Bank of America ",
        "title": "UI/UX Designer",
        "years": "November 2018 - Febuary 2022",
        "description": "As a UI/UX Designer, I led the design and development of key banking features, focusing on delivering user-centered solutions that drove measurable business outcomes. My expertise in user research, design thinking, and cross-functional collaboration allowed me to create seamless, responsive, and accessible experiences for both mobile and desktop platforms, resulting in significant user engagement and satisfaction improvements. Bill Payment Feature Success: Led the design of the bank’s mobile app Bill Payment feature, increasing user adoption by 25% and reducing drop-off rates during transactions through intuitive design improvements. User-Centric Research & Design: Conducted extensive user research (interviews, surveys, usability testing) to identify customer pain points, driving actionable design improvements that increased task completion rates by 15%. Cross-Platform Optimization: Designed responsive interfaces optimized for both mobile and desktop, ensuring a consistent and user-friendly experience across devices, improving usability metrics by 15%. Data-Driven Improvements: Utilized data analytics, heatmaps, and A/B testing to optimize UI elements and navigation, reducing user drop-off by 10% and improving overall engagement. Collaboration & Agile Methodology: Worked within an Agile framework, collaborating closely with product managers, developers, and stakeholders to align designs with technical feasibility and business goals, accelerating the release cycle by 10%. Accessibility Focus: Led accessibility testing to ensure WCAG compliance, broadening the app’s usability to users with disabilities and enhancing inclusivity. With deep expertise in UI/UX tools (Figma, Adobe XD, Sketch) and front-end development skills (HTML5, CSS3, JavaScript, Angular), I consistently delivered high-quality, user-centered design solutions that aligned with business objectives and enhanced the overall customer experience."
      },
      {
        "company": "TD Bank ",
        "title": "Junior UI/UX Designer",
        "years": "April 2017 - November 2018",
        "description": "As a Junior UI/UX Designer at TD Bank, I collaborated with senior designers and cross-functional teams to create user-centered designs for internal platforms and customer-facing applications. My contributions helped streamline user interactions and improve the overall banking experience, while I developed skills in both design and front-end development. Design Contributions: Assisted in creating wireframes, mockups, and prototypes for mobile apps, ATM interfaces, and online banking systems, improving user experience and increasing satisfaction by 10%. User-Centered Research: Participated in user research activities, including interviews, surveys, and usability testing, translating insights into actionable design solutions for product enhancements. Cross-Platform Design: Supported the implementation of responsive design principles, ensuring consistent user experiences across mobile, desktop, and tablet devices. Collaboration & Agile: Worked closely with front-end developers and product teams within Agile workflows to ensure alignment between design and development, reducing average task completion times by 15%. Impactful UX Enhancements: Helped redesign the ATM interface, reducing transaction errors by 12% and improving accessibility features for visually impaired users. Continuous Learning: Developed expertise in tools such as Sketch, Figma, and Adobe XD, while gaining hands-on experience in HTML, CSS, and JavaScript to create technically feasible design solutions. With a passion for creating intuitive, user-friendly interfaces, I continuously seek to expand my skills in UX best practices and human-centered design methodologies."
      }

    ],
    "skills": [
      {
        "name": "UI/UX",
        "level": "100%"
      },
      {
        "name": "HTML",
        "level": "80%"
      },
      {
        "name": "CSS",
        "level": "80%"
      },
      {
        "name": "JavaScript",
        "level": "70%"
      },
      {
        "name": "Angular",
        "level": "60%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "CYNC SOfTWARE CASE STUDY",
        "category": "Case Study",
        "image": "Cync Software Loan Origination System.jpg",
        "url": "https://www.behance.net/gallery/208533863/CYNC-LOS"
      },
      {
        "title": "BANK OF AMERICA CASE STUDY",
        "category": "Case Study",
        "image": "Bank of America Mobile App.jpg",
        "url": "https://xd.adobe.com/view/5a0cc979-6210-4127-8c48-4669cf9f0cf2-0f5f/?fullscreen"
      },
      {
        "title": "Twitter Clone",
        "category": "Social Media",
        "image": "Twitter.jpg",
        "url": "https://twitter-clone-83a92.firebaseapp.com/?"
      },
      {
        "title": "Animations",
        "category": "Angular Animation Application",
        "image": "Animations.jpg",
        "url": "https://animations-a7d93.web.app"
      },
      {
        "title": "KanbanFire",
        "category": "Angular Todo Application",
        "image": "KanbanFire.jpg",
        "url": "https://kanban-fire-be71d.web.app"
      },
      {
        "title": "Ng-Video-Game",
        "category": "Angular Gaming Application",
        "image": "Ng-Video-Game.jpg",
        "url": "https://ng-video-game-db.web.app"
      },
      {
        "title": "My Budget Planner",
        "category": "Budget Planner",
        "image": "Budget-Planner.jpg",
        "url": "https://61f0efec215e813c8ff08265--hardcore-roentgen-8b2667.netlify.app/"
      },
      {
        "title": "Todo Application",
        "category": "React todo application",
        "image": "React-todo.png",
        "url": "https://todo-cda1b8.netlify.app/"
      }
    ]
  },
  "Quote": {
    "Quote": [
      {
        "text": "Work harder than the other person in the room no matter how hard it is get the work done and give everything you have in you toward the work you really love.",
        "user": "Manish Sondhi"
      },
      {
        "text": "I’m not a great programmer; I’m just a good programmer with great habits.",
        "user": "Kent Beck"
      },
      {
        "text": "Real programmers can write assembly code in any language.",
        "user": "Larry Wall"
      },
      {
        "text": "People ignore design that ignores people.",
        "user": "Frank Chimero"
      }
    ]
  }
}
